
&НаКлиенте
Процедура ЗаменитьФайл(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	    
	НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
        ПутьКФайлу = ПереданныйФайл.Имя;
		Объект.КомментарийКФайлуИсточнику = ПутьКФайлу;      
        Адрес = ПереданныйФайл.Хранение;
		ПоместитьДвоичныеДанныеФайлаОбработкиВРеквизит(Адрес)
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ПоместитьДвоичныеДанныеФайлаОбработкиВРеквизит(АдресХранилищаЗначения)
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанныеФайлаОбработки = ПолучитьИзВременногоХранилища(АдресХранилищаЗначения);
	ТекущийОбъект.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеФайлаОбработки);
	ТекущийОбъект.Записать();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");	
КонецПроцедуры

&НаСервере
Функция ЗапуститьПроверкуНаСервере()
	
	АдресХранилищаЗначения = ПоместитьВоВременноеХранилище(Неопределено);
	АсинхронныеОбработчики.ВыполнитьПроверкуВнешнейОбработки(АдресХранилищаЗначения, Объект.Ссылка);
	Результат = ПолучитьИзВременногоХранилища(АдресХранилищаЗначения);
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат Результат;	
	Иначе
		МассивРезультатов = Новый Массив;
		МассивРезультатов.Добавить(Результат);
		Возврат МассивРезультатов;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьПроверку(Команда)
	
	МассивРезультатов = ЗапуститьПроверкуНаСервере();
	
	Для Каждого ЭлементРезультата Из МассивРезультатов Цикл
		Сообщить(ЭлементРезультата);
	КонецЦикла;
	
КонецПроцедуры
