Процедура ВыполнитьПроверкуВнешнейОбработки(АдресХранилищаРезультата, ОбработкаПроверкиСсылка) Экспорт
	
	Результат = Неопределено;
	
	ОбработкаПроверкиОбъект = ПолучитьОбработкуПроверки(ОбработкаПроверкиСсылка);
	
	Если ОбработкаПроверкиОбъект <> Неопределено Тогда 
		
		Попытка
			Результат = ОбработкаПроверкиОбъект.ПолучитьРезультатПроверки();
		Исключение
			Результат = Новый Массив;
			Результат.Добавить(Истина);
			Результат.Добавить(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Истина);
		Результат.Добавить("Не удалось получить объект внешней обработки из хранилища.");		
		
	КонецЕсли;  	
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилищаРезультата);	
	
КонецПроцедуры

Функция ПолучитьОбработкуПроверки(СправочникСсылка)
	
	Если ЗначениеЗаполнено(СправочникСсылка) И СправочникСсылка.ХранилищеВнешнейОбработки <> Неопределено Тогда
										
		ДвоичныеДанные = СправочникСсылка.ХранилищеВнешнейОбработки.Получить();
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Возврат ВнешниеОбработки.Создать(ИмяФайла);
			
		КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции